// Hér kemur kóðinn þinn:



function setup(){
    createCanvas(640,640);
    background(255);
    fill(234,235,230);
    noStroke();
    rect(20,355,255,265);
    rect(285,355,281,235);
    rect(575,475,45,145);
    rect(285,23,335,325);
    fill(196,50,37);
    rect(20,23,255,325);
    fill(32,72,144);
    rect(575,355,45,100);
    fill(247,212,60);
    rect(285,600,152,20);
    fill(38,37,40);
    rect(445,600,122,20);
    fill(0);
    rect(275,23,10,597);
    rect(20,345,600,10);
    rect(566,353,10,267);
    rect(575,454,45,20);
    rect(285,590,285,10);
    rect(437,600,10,20);
}
